---
kind: type
id: T:Autodesk.Revit.DB.SpecialType
source: html/c4dd5703-709a-729c-7ec5-c7f16c77cf38.htm
---
# Autodesk.Revit.DB.SpecialType

An enumerated type listing special types that can appear in an ExportLayerTable .
 These types do not represent an independent category in Revit, but can be mapped to specific layers on export.

## Syntax (C#)
```csharp
public enum SpecialType
```